from funcs import DIR, NOT, CALL, CALL2, win


ru_category = {'2': 'Автомобили и транспорт', '23': 'Комедия', '27': 'Образование',
'24': 'Развлечения', '1': 'Кино и анимация', '20': 'Игры', '26': 'Howto и Стиль',
'10': 'Музыка', '25': 'Новости и Политика ','29':' Некоммерческие и некоммерческие организации; Активизм ',
'22': 'Люди и Блоги ','15':' Питомцы и Животные ','28':' Наука и Технология',
'17': 'Спорт', '19': 'Путешествия и путешествия, События'}



category = {'2': 'Autos & Vehicles', '23': 'Comedy', '27': 'Education', 
'24': 'Entertainment', '1': 'Film and Animation', '20': 'Gaming', '26': 'Howto &amp; Style', 
'10': 'Music', '25': 'News &amp; Politics', '29': 'Nonprofits &amp; Activism', 
'22': 'People &amp; Blogs', '15': 'Pets &amp; Animals', '28': 'Science &amp; Technology', 
'17': 'Sports', '19': 'Travel &amp; Events'}

topics = {'1': 'Action game', '29': 'Action-adventure game', '8': 'American football', '44': 'Association football', '68': 'Baseball', 
'50': 'Basketball', '59': 'Boxing', '69': 'Business', '56': 'Casual game', '52': 'Christian music', 
'34': 'Classical music', '31': 'Country music', '58': 'Cricket', '15': 'Electronic music', 
'4': 'Entertainment', '39': 'Fashion', '13': 'Film', '5': 'Food', '65': 'Golf', '11': 'Health', 
'7': 'Hip hop music', '24': 'Hobby', '53': 'Humour', '66': 'Ice hockey', '35': 'Independent music', 
'64': 'Jazz', '12': 'Knowledge', '10': 'Lifestyle (sociology)', '63': 'Military', '62': 'Mixed martial arts', 
'54': 'Motorsport', '9': 'Music', '51': 'Music of Asia', '48': 'Music of Latin America', '61': 'Music video game', '33': 'Performing arts', 
'37': 'Pet', '70': 'Physical attractiveness', '46': 'Physical fitness', '42': 'Politics', 
'30': 'Pop music', '55': 'Professional wrestling', '57': 'Puzzle video game', '41': 'Racing video game', 
'60': 'Reggae', '43': 'Religion', '47': 'Rhythm and blues', '32': 'Rock music', '14': 'Role-playing video game', '26': 'Simulation video game', 
'27': 'Society', '49': 'Soul music', '6': 'Sport', '2': 'Sports game', '28': 'Strategy video game', 
'25': 'Technology', '40': 'Television program', '67': 'Tennis', '38': 'Tourism', '36': 'Vehicle', 
'3': 'Video game culture', '45': 'Volleyball'}

ru_topics = {'1': 'Экшн-игра', '29': 'Экшн-приключенческая игра', '8': 'Американский футбол', '44': 'Футбольная ассоциация', '68': 'Бейсбол',
'50': 'Баскетбол', '59': 'Бокс', '69': 'Бизнес', '56': 'Казуальная игра', '52': 'Христианская музыка',
'34': 'Классическая музыка', '31': 'Музыка кантри', '58': 'Крикет', '15': 'Электронная музыка',
'4': 'Развлечения', '39': 'Мода', '13': 'Кино', '5': 'Еда', '65': 'Гольф', '11': 'Здоровье',
'7': 'Музыка хип-хопа', '24': 'Хобби', '53': 'Юмор', '66': 'Хоккей', '35': 'Независимая музыка',
'64': 'Джаз', '12': 'Знание', '10': 'Образ жизни (социология)', '63': 'Военные', '62': 'Смешанные боевые искусства',
'54': 'Автоспорт', '9': 'Музыка', '51': 'Музыка Азии', '48': 'Музыка Латинской Америки', '61': 'Музыкальная видеоигра', '33': 'Исполнительское искусство',
'37': 'Домашнее животное', '70': 'Физическая привлекательность', '46': 'Физическая подготовка', '42': 'Политика',
'30': 'Поп-музыка', '55': 'Профессиональная борьба', '57': 'Головоломка', '41': 'Гоночная видеоигра',
'60': 'регги', '43': 'религия', '47': 'ритм-н-блюз', '32': 'рок-музыка', '14': 'ролевая видеоигра', '26': 'Симулятор видеоигры',
'27': 'Общество', '49': 'Музыка души', '6': 'Спорт', '2': 'Спортивная игра', '28': 'Стратегическая видеоигра',
'25': 'Технология', '40': 'Телепрограмма', '67': 'Теннис', '38': 'Туризм', '36': 'Транспортное средство',
'3': 'Культура видеоигр', '45': 'Волейбол'}


lang = {'382': 'Abkhazian', '381': 'Afar', '105': 'Afrikaans', '383': 'Akan', '9': 'Albanian', '58': 'Amharic', '11': 'Arabic', 
'14': 'Armenian', '384': 'Assamese', '29': 'Aymara', '19': 'Azerbaijani', '385': 'Bashkir', '54': 'Basque', '27': 'Belarusian', 
'22': 'Bengali', '386': 'Bihari', '141': 'Bislama', '24': 'Bosnian', '388': 'Breton', '389': 'Buginese', 
'23': 'Bulgarian', '100': 'Burmese', '10': 'Catalan', '390': 'Cebuano', '391': 'Cherokee', '449': 'Chinese Simplified', 
'450': 'Chinese Traditional', '392': 'Corsican', '25': 'Croatian', '48': 'Czech', '50': 'Danish', '395': 'Dhivehi', '1': 'Dutch', 
'32': 'Dzongkha', '396': 'Egyptian', '7': 'English', '397': 'Esperanto', '57': 'Estonian', '62': 'Faroese', '60': 'Fijian', 
'59': 'Finnish', '17': 'French', '398': 'Frisian', '55': 'Galician', '416': 'Ganda', '63': 'Georgian', '21': 'German', '401': 'Gothic', '46': 'Greek', 
'65': 'Greenlandic', '400': 'Guarani', '402': 'Gujarati', '67': 'Haitian Creole', '403': 'Hausa', '404': 'Hawaiian', 
'78': 'Hebrew', '71': 'Hindi', '405': 'Hmong', '68': 'Hungarian', '77': 'Icelandic', '408': 'Igbo', 
'69': 'Indonesian', '406': 'Interlingua', '407': 'Interlingue', '410': 'Inuktitut', '409': 'Inupiak', '73': 'Irish', '37': 'Italian', 
'82': 'Japanese', '411': 'Javanese', '413': 'Kannada', '414': 'Kashmiri', 
'83': 'Kazakh', '412': 'Khasi', '85': 'Khmer', '126': 'Kinyarwanda', '440': 'Klingon', '87': 'Korean', '415': 'Kurdish', '84': 'Kyrgyz', 
'418': 'Laothian', '139': 'Latin', '93': 'Latvian', '417': 'Limbu', '41': 'Lingala', '91': 'Lithuanian', '92': 'Luxembourgish', 
'98': 'Macedonian', '95': 'Malagasy', '31': 'Malay', '419': 'Malayalam', '99': 'Maltese', 
'70': 'Manx', '118': 'Maori', '420': 'Marathi', '103': 'Mauritian Creole', '101': 'Mongolian', '117': 'Nauru', '421': 'Ndebele', 
'116': 'Nepali', '33': 'Norwegian', '423': 'Nyanja', '56': 'Occitan', '425': 'Oriya', '424': 'Oromo', '4': 'Pashto', '422': 'Pedi', 
'74': 'Persian', '125': 'Polish', '6': 'Portuguese', '426': 'Punjabi', '30': 'Quechua', '427': 'Rhaeto Romance', '94': 'Romanian', 
'428': 'Rundi', '15': 'Russian', '16': 'Samoan', '35': 'Sango', '429': 'Sanskrit', '430': 'Scots', '399': 'Scots Gaelic', 
'26': 'Serbian', '393': 'Seselwa', '435': 'Sesotho', '153': 'Shona', '431': 'Sindhi', '432': 'Sinhalese', '434': 'Siswant', '49': 'Slovak', 
'433': 'Slovenian', '127': 'Somali', '13': 'Spanish', '436': 'Sundanese', '43': 'Swahili', 
'8': 'Swedish', '437': 'Syriac', '439': 'Tagalog', '132': 'Tajik', '72': 'Tamil', '441': 'Tatar', '438': 'Telugu', '131': 'Thai', 
'387': 'Tibetan', '51': 'Tigrinya', '154': 'Tonga', '144': 'Tsonga', '34': 'Tswana', '47': 'Turkish', '5': 'Turkmen', '442': 'Uighur', 
'137': 'Ukrainian', '120': 'Urdu', '138': 'Uzbek', '145': 'Venda', '140': 'Vietnamese', '443': 'Volapuk', '444': 'Waray Philippines', 
'394': 'Welsh', '445': 'Wolof', '146': 'Xhosa', '446': 'Yiddish', '447': 'Yoruba', '448': 'Zhuang', '147': 'Zulu'}

ru_lang = {'382': 'абхазский', '381': 'афарский', '105': 'африкаанс', '383': 'акан', '9': 'албанский', '58': 'амхарский', '11 ':' Арабский ',
'14': 'армянский', '384': 'ассамский', '29': 'аймара', '19': 'азербайджанский', '385': 'башкирский', '54': 'баскский', '27 ':' Белорусский ',
'22': 'бенгальский', '386': 'бихари', '141': 'бислама', '24': 'боснийский', '388': 'бретонский', '389': 'бугийский',
'23': 'болгарский', '100': 'бирманский', '10': 'каталонский', '390': 'кебуанский', '391': 'чероки', '449': 'упрощенный китайский',
'450': 'традиционный китайский', '392': 'корсиканский', '25': 'хорватский', '48': 'чешский', '50': 'датский', '395': 'дивехи', ' 1 ':' голландский ',
'32': 'дзонгха', '396': 'египетский', '7': 'английский', '397': 'эсперанто', '57': 'эстонский', '62': 'фарерский', '60 ':' Фиджийский ',
'59': 'финский', '17': 'французский', '398': 'фризский', '55': 'галисийский', '416': 'ганда', '63': 'грузинский', '21':'Немецкий',' 401 ':' готический','46 ':' греческий ',
'65': 'гренландский', '400': 'гуарани', '402': 'гуджарати', '67': 'гаитянский креольский', '403': 'хауса', '404': 'гавайский',
'78': 'иврит', '71': 'хинди', '405': 'хмонг', '68': 'венгерский', '77': 'исландский', '408': 'игбо',
'69': 'индонезийский', '406': 'интерлингва', '407': 'интерлингва', '410': 'инуктитут', '409': 'инупиак', '73': 'ирландский', '37 ':' Итальянский ',
'82': 'японский', '411': 'яванский', '413': 'канадский', '414': 'кашмирский',
'83': 'казахский', '412': 'кхаси', '85': 'кхмерский', '126': 'киньяруанда', '440': 'клингонский', '87': 'корейский', '415 ':' Курдский ','84':' киргизский ',
'418': 'Лаотский', '139': 'Латышский', '93': 'Латышский', '417': 'Лимбу', '41': 'Лингала', '91': 'Литовский', '92 ':' Люксембургский ',
'98': 'македонский', '95': 'малагасийский', '31': 'малайский', '419': 'малаялам', '99': 'мальтийский',
'70': 'мэнский', '118': 'маори', '420': 'маратхи', '103': 'маврикийский креольский', '101': 'монгольский', '117': 'науру', '421':' Ндебеле ',
'116': 'непальский', '33': 'норвежский', '423': 'ньянджа', '56': 'окситанский', '425': 'ория', '424': 'оромо', '4 ':' Пушту ','422':' Педи ',
'74': 'персидский', '125': 'польский', '6': 'португальский', '426': 'пенджабский', '30': 'кечуа', '427': 'рето-романс', '94':' румынский ',
'428': 'рунди', '15': 'русский', '16': 'самоанский', '35': 'санго', '429': 'санскрит', '430': 'шотландский', '399':' Шотландский гэльский ',
'26': 'сербский', '393': 'Seselwa', '435': 'Sesotho', '153': 'Shona', '431': 'синдхи', '432': 'сингальский', '434':' Siswant ','49':' Словацкий ',
'433': 'словенский', '127': 'сомалийский', '13': 'испанский', '436': 'сунданский', '43': 'суахили',
'8': 'шведский', '437': 'сирийский', '439': 'тагальский', '132': 'таджикский', '72': 'тамильский', '441': 'татарский', '438 ':' Телугу','131 ':' тайский ',
'387': 'Тибетский', '51': 'Тигринья', '154': 'Тонга', '144': 'Цонга', '34': 'Тсвана', '47': 'Турецкий', '5 ':' Туркменский','442 ':' уйгурский ',
'137': 'украинский', '120': 'урду', '138': 'узбекский', '145': 'венда', '140': 'вьетнамский', '443': 'волапук', '444':' Варай Филиппины ',
'394': 'валлийский', '445': 'волоф', '146': 'коса', '446': 'идиш', '447': 'йоруба', '448': 'чжуан', '147 ':' Зулусский '
}

country = {'2': 'United States', '1': 'United Kingdom', '3': 'Canada', '4': 'Australia', 
'310': 'Afghanistan', '311': 'Aland Islands', '312': 'Albania', '313': 'Algeria', 
'15': 'American Samoa', '315': 'Andorra', '316': 'Angola', '21': 'Anguilla', '318': 'Antarctica', 
'25': 'Antigua &amp; Barbuda', '45': 'Argentina', '321': 'Armenia', '35': 'Aruba', '39': 'Austria', 
'325': 'Azerbaijan', '11': 'Bahamas', '327': 'Bahrain', '328': 'Bangladesh', '17': 'Barbados', 
'330': 'Belarus', '30': 'België', '332': 'Belize', '333': 'Benin', '18': 'Bermuda', '335': 
'Bhutan', '52': 'Bolivia', '337': 'Bosnia and Herzegovina', '338': 'Botswana', '339': 'Bouvet Island', 
'340': 'Brazil', '14': 'British Indian Ocean Territory', '343': 'Brunei Darussalam', '344': 'Bulgaria', 
'345': 'Burkina Faso', '346': 'Burundi', '347': 'Cambodia', '348': 'Cameroon', '350': 'Cape Verde', 
'27': 'Cayman Islands', '352': 'Central African Republic', '353': 'Chad', '48': 'Chile', 
'355': 'China', '358': 'Christmas Island', '359': 'Cocos (Keeling) Islands', '44': 'Colombia', 
'361': 'Comoros', '362': 'Congo (Brazzaville)', '363': 'Congo, Democratic Republic of the', 
'364': 'Cook Islands', '58': 'Costa Rica', '367': 'Croatia', '51': 'Cuba', '31': 'Curacao', 
'369': 'Cyprus', '370': 'Czech Republic', '371': 'Denmark', '372': 'Djibouti', '373': 'Dominica', 
'53': 'Dominican Republic', '49': 'Ecuador', '376': 'Egypt', '56': 'El Salvador', '62': 'Equatorial Guinea', '379': 'Eritrea', '380': 'Estonia', '381': 'Ethiopia', '20': 'Falkland Islands', 
'383': 'Faroe Islands', '384': 'Fiji', '41': 'Finland', '386': 'France', '387': 'French Guiana', 
'388': 'French Polynesia', '389': 'French Southern Territories', '390': 'Gabon', '391': 'Gambia', '392': 'Georgia', 
'37': 'Germany', '394': 'Ghana', '395': 'Gibraltar', '396': 'Greece', '397': 'Greenland', 
'13': 'Grenada', '399': 'Guadeloupe', '400': 'Guam', '50': 'Guatemala', '402': 'Guernsey', 
'403': 'Guinea', '404': 'Guinea-Bissau', '10': 'Guyana', 
'406': 'Haiti', '407': 'Heard Island and Mcdonald Islands', '408': 'Holy See (Vatican City State)', 
'54': 'Honduras', '356': 'Hong Kong, Special Administrative Region of China', 
'410': 'Hungary', '411': 'Iceland', '99': 'India', '413': 'Indonesia', '414': 'Iran, Islamic Republic of', 
'415': 'Iraq', '6': 'Ireland', '16': 'Isle of Man', '418': 'Israel', '419': 'Italy', 
'366': 'Ivory Coast', '8': 'Jamaica', '421': 'Japan', '422': 'Jersey', '423': 'Jordan', '424': 'Kazakhstan', 
'425': 'Kenya', '426': 'Kiribati', '427': "Korea, Democratic People's Republic of", 
'428': 'Korea, Republic of', '557': 'Kosovo', '429': 'Kuwait', '430': 'Kyrgyzstan', '431': 'Lao PDR', 
'432': 'Latvia', '433': 'Lebanon', '434': 'Lesotho', '435': 'Liberia', '436': 'Libya', '36': 'Liechtenstein', '438': 'Lithuania', 
'40': 'Luxembourg', '357': 'Macao, Special Administrative Region of China', 
'441': 'Madagascar', '442': 'Malawi', '443': 'Malaysia', '444': 'Maldives', '445': 'Mali', '446': 'Malta', 
'447': 'Marshall Islands', '448': 'Martinique', '449': 'Mauritania', '450': 'Mauritius', '451': 'Mayotte', '43': 'Mexico', 
'453': 'Micronesia, Federated States of', '454': 'Moldova', '455': 'Monaco', 
'456': 'Mongolia', '457': 'Montenegro', '28': 'Montserrat', '459': 'Morocco', '460': 'Mozambique', 
'461': 'Myanmar', '462': 'Namibia', '463': 'Nauru', '29': 'Nederland', 
'33': 'Nederlandse Antillen', '464': 'Nepal', '467': 'New Caledonia', '5': 'New-Zealand', '57': 'Nicaragua', '470': 'Niger', '471': 'Nigeria', 
'472': 'Niue', '473': 'Norfolk Island', '440': 'North-Macedonia', '474': 'Northern Mariana Islands', '475': 'Norway', '476': 'Oman', '477': 'Pakistan', '478': 'Palau', 
'479': 'Palestinian Territory, Occupied', '60': 'Panama', '481': 'Papua New Guinea', '55': 'Paraguay', '46': 'Peru', '484': 'Philippines', '22': 'Pitcairn', 
'486': 'Poland', '487': 'Portugal', '59': 'Puerto Rico', '489': 'Qatar', '490': 'Réunion', '491': 'Romania', '492': 'Russian Federation', '493': 'Rwanda', 
'24': 'Saint Helena, Ascension &amp; Tristan da Cunha', '26': 'Saint Kitts &amp; Nevis', '497': 'Saint Lucia', '499': 'Saint Pierre and Miquelon', 
'12': 'Saint Vincent &amp; The Grenadines', '494': 'Saint-Barth', '498': 'Saint-Martin (French part)', 
'501': 'Samoa', '502': 'San Marino', '503': 'Sao Tome and Principe', '504': 'Saudi Arabia', '505': 'Senegal', '506': 'Serbia', '507': 'Seychelles', 
'508': 'Sierra Leone', '509': 'Singapore', '34': 'Sint-Maarten', '510': 'Slovakia', '511': 'Slovenia', 
'512': 'Solomon Islands', '513': 'Somalia', '515': 'South Georgia and the South Sandwich Islands', 
'516': 'South Sudan', '7': 'South-Africa', '42': 'Spain', '518': 'Sri Lanka', '519': 'Sudan', 
'32': 'Suriname', '521': 'Svalbard and Jan Mayen Islands', '522': 'Swaziland', '523': 'Sweden', 
'38': 'Switzerland', '525': 'Syrian Arab Republic (Syria)', 
'526': 'Taiwan, Republic of China', '527': 'Tajikistan', '528': 'Tanzania', '529': 'Thailand', 
'530': 'Timor-Leste', '531': 'Togo', '532': 'Tokelau', '533': 'Tonga', '9': 'Trinidad &amp; Tobago', 
'535': 'Tunisia', '536': 'Turkey', '537': 'Turkmenistan', '538': 'Turks and Caicos Islands', '539': 'Tuvalu', 
'540': 'Uganda', '541': 'Ukraine', '542': 'United Arab Emirates', '545': 'United States Minor Outlying Islands', '61': 'Uruguay', '547': 'Uzbekistan', '548': 'Vanuatu', '47': 'Venezuela', 
'550': 'Viet Nam', '23': 'Virgin Islands, British', '19': 'Virgin Islands, U.S.', 
'552': 'Wallis & Futuna Islands', '553': 'Western Sahara', '554': 'Yemen', '555': 'Zambia', '556': 'Zimbabwe'}

ru_country  = {'2': 'Соединенные Штаты', '1': 'Соединенное Королевство', '3': 'Канада', '4': 'Австралия',
'310': 'Афганистан', '311': 'Аландские острова', '312': 'Албания', '313': 'Алжир',
'15': 'Американское Самоа', '315': 'Андорра', '316': 'Ангола', '21': 'Ангилья', '318': 'Антарктида',
'25': 'Antigua & amp; Барбуда','45':'Аргентина','321':' Армения ','35':' Аруба ','39':' Австрия ',
'325': 'Азербайджан', '11': 'Багамы', '327': 'Бахрейн', '328': 'Бангладеш', '17': 'Барбадос',
'330': 'Беларусь', '30': 'Бельгия', '332': 'Белиз', '333': 'Бенин', '18': 'Бермудские острова', '335':
'Бутан', '52': 'Боливия', '337': 'Босния и Герцеговина', '338': 'Ботсвана', '339': 'Остров Буве',
'340': 'Бразилия', '14': 'Британская территория в Индийском океане', '343': 'Бруней-Даруссалам', '344': 'Болгария',
'345': 'Буркина-Фасо', '346': 'Бурунди', '347': 'Камбоджа', '348': 'Камерун', '350': 'Кабо-Верде',
'27': 'Каймановы острова', '352': 'Центральноафриканская Республика', '353': 'Чад', '48': 'Чили',
'355': 'Китай', '358': 'Остров Рождества', '359': 'Кокосовые острова (острова Килинг)', '44': 'Колумбия',
'361': 'Коморские острова', '362': 'Конго (Браззавиль)', '363': 'Конго, Демократическая Республика',
'364': 'Острова Кука', '58': 'Коста-Рика', '367': 'Хорватия', '51': 'Куба', '31': 'Кюрасао',
'369': 'Кипр', '370': 'Чешская Республика', '371': 'Дания', '372': 'Джибути', '373': 'Доминика',
'53': 'Доминиканская Республика', '49': 'Эквадор', '376': 'Египет', '56': 'Сальвадор', '62': 'Экваториальная Гвинея', '379': 'Эритрея' , '380': 'Эстония', '381': 'Эфиопия', '20': 'Фолклендские острова',
'383': 'Фарерские острова', '384': 'Фиджи', '41': 'Финляндия', '386': 'Франция', '387': 'Французская Гвиана',
'388': 'Французская Полинезия', '389': 'Южные французские территории', '390': 'Габон', '391': 'Гамбия', '392': 'Грузия',
'37': 'Германия', '394': 'Гана', '395': 'Гибралтар', '396': 'Греция', '397': 'Гренландия',
'13': 'Гренада', '399': 'Гваделупа', '400': 'Гуам', '50': 'Гватемала', '402': 'Гернси',
'403': 'Гвинея', '404': 'Гвинея-Бисау', '10': 'Гайана', '406': 'Гаити', '407': 'Остров Херд и острова Макдональд', '408': 'Святой Престол (государство-город Ватикан)',
'54': 'Гондурас', '356': 'Гонконг, специальный административный район Китая',
'410': 'Венгрия', '411': 'Исландия', '99': 'Индия', '413': 'Индонезия', '414': 'Иран, Исламская Республика',
'415': 'Ирак', '6': 'Ирландия', '16': 'остров Мэн', '418': 'Израиль', '419': 'Италия',
'366': "Кот-д'Ивуар", '8': 'Ямайка', '421': 'Япония', '422': 'Джерси', '423': 'Иордания', '424': 'Казахстан',
'425': 'Кения', '426': 'Кирибати', '427': 'Корея, Народно-Демократическая Республика',
'428': 'Республика Корея', '557': 'Косово', '429': 'Кувейт', '430': 'Кыргызстан', '431': 'Лаосская НДР',
'432': 'Латвия', '433': 'Ливан', '434': 'Лесото', '435': 'Либерия', '436': 'Ливия', '36': 'Лихтенштейн', '438':'Литва', '40': 'Люксембург', '357': 'Макао, особый административный район Китая',
'441': 'Мадагаскар', '442': 'Малави', '443': 'Малайзия', '444': 'Мальдивы', '445': 'Мали', '446': 'Мальта',
'447': 'Маршалловы Острова', '448': 'Мартиника', '449': 'Мавритания', '450': 'Маврикий', '451': 'Майотта', '43': 'Мексика',
'453': 'Микронезия, Федеративные Штаты', '454': 'Молдова', '455': 'Монако', '456': 'Монголия', '457': 'Черногория', '28': 'Монтсеррат', '459': 'Марокко', '460': 'Мозамбик',
'461': 'Мьянма', '462': 'Намибия', '463': 'Науру', '29': 'Нидерланды', '33': 'Nederlandse Antillen', '464': 'Непал', '467': 'Новая Каледония', '5': 'Новая Зеландия', '57': 'Никарагуа', '470': 'Нигер', '471': 'Нигерия ',
'472': 'Ниуэ', '473': 'Остров Норфолк', '440': 'Северная Македония', '474': 'Северные Марианские острова', '475': 'Норвегия', '476': ' Оман','477 ':' Пакистан','478 ':' Палау ',
'479': 'Палестинская территория, оккупированная', '60': 'Панама', '481': 'Папуа-Новая Гвинея', '55': 'Парагвай', '46': 'Перу', '484': ' Филиппины','22 ':' Питкэрн ',
'486': 'Польша', '487': 'Португалия', '59': 'Пуэрто-Рико', '489': 'Катар', '490': 'Реюньон', '491': 'Румыния', '492': 'Российская Федерация','493':' Руанда ',
'24': 'Остров Святой Елены, Вознесение & amp; Тристан да Кунья','26 ':' Saint Kitts & amp; Невис','497 ':' Сент-Люсия','499 ':' Сен-Пьер и Микелон ',
'12': 'Сент-Винсент и amp; Гренадины','494 ':' Сен-Барт','498 ':' Сен-Мартен (французская часть) ',
'501': 'Самоа', '502': 'Сан-Марино', '503': 'Сан-Томе и Принсипи', '504': 'Саудовская Аравия', '505': 'Сенегал', '506': ' Сербия','507 ':' Сейшелы ',
'508': 'Сьерра-Леоне', '509': 'Сингапур', '34': 'Синт-Мартен', '510': 'Словакия', '511': 'Словения',
'512': 'Соломоновы острова', '513': 'Сомали', '515': 'Южная Георгия и Южные Сандвичевы острова',
'516': 'Южный Судан', '7': 'Южная Африка', '42': 'Испания', '518': 'Шри-Ланка', '519': 'Судан',
'32': 'Суринам', '521': 'Острова Шпицберген и Ян-Майен', '522': 'Свазиленд', '523': 'Швеция',
'38': 'Швейцария', '525': 'Сирийская Арабская Республика (Сирия)',
'526': 'Тайвань, Китайская Республика', '527': 'Таджикистан', '528': 'Танзания', '529': 'Таиланд',
'530': 'Тимор-Лешти', '531': 'Того', '532': 'Токелау', '533': 'Тонга', '9': 'Тринидад и amp; Тобаго ',
'535': 'Тунис', '536': 'Турция', '537': 'Туркменистан', '538': 'Острова Теркс и Кайкос', '539': 'Тувалу',
'540': 'Уганда', '541': 'Украина', '542': 'Объединенные Арабские Эмираты', '545': 'Внешние малые острова США', '61': 'Уругвай', '547': 'Узбекистан', '548': 'Вануату', '47': 'Венесуэла',
'550': 'Вьетнам', '23': 'Виргинские острова, Британские', '19': 'Виргинские острова, США',
'552': 'Острова Уоллис и Футуна', '553': 'Западная Сахара', '554': 'Йемен', '555': 'Замбия', '556': 'Зимбабве'}


ru_category = DIR(ru_category)
category = DIR(category)
ru_country = DIR(ru_country)
country = DIR(country)
ru_lang = DIR(ru_lang)
lang = DIR(lang)
ru_topics = DIR(ru_topics)
topics = DIR(topics)

lang2 = {v:k for k, v in DIR(lang).items()}
country2 = {v:k for k, v in DIR(country).items()}
category2 = {v:k for k, v in DIR(category).items()}
topics2 = {v:k for k, v in DIR(topics).items()}



creation_date_min = {'7': '1 week', '14': '2 weeks', '30': '1 month', '60': '2 months', 
'90': '3 months', '180': '6 months', '365': '1 year', '730': '2 years'}
creation_date_max = {'7': '1 week', '14': '2 weeks', '30': '1 month', '60': '2 months', 
'90': '3 months', '180': '6 months', '365': '1 year', '730': '2 years'}

nums = {'0': '0', '100': '100', '200': '200', '500': '500', '1000': '1,000', 
'2000': '2,000', '5000': '5,000', '10000': '10,000', '20000': '20,000', '50000': '50,000', 
'100000': '100,000', '200000': '200,000', '500000': '500,000', '1000000': '1,000,000', 
'2000000': '2,000,000', '5000000': '5,000,000'}

dates = {'7': '1 неделя', '14': '2 недели', '30': '1 месяц', '60': '2 месяца',
'90': '3 месяца', '180': '6 месяцев', '365': '1 год', '730': '2 года'}

total_videos_min = {'0': '0', '10': '10', '20': '20', '30': '30', '40': '40', '50': '50', 
'75': '75', '100': '100', '150': '150', '200': '200', '300': '300', '500': '500'}

subscribers_min = nums
subscribers_max = nums
total_views_min = nums
total_views_max = nums


total_videos_max = total_videos_min

lastest_video_max = dates
lastest_video_min = dates

#tags = [category,topics,lang,country, creation_date, subscribers, total_views, total_views,lastest_video]

RU = {"name_chanell":"имя канала",
"topics":"тема", 
"lang":"язык", 
"country":"страна",
"category":"категория",
"creation_date_min":"дата создания от",
"creation_date_max":"дата создания до",
"subscribers_min":"подписчиков от",
"subscribers_max":"подписчиков до",
"total_views_min":"всего просмотров от",
"total_views_max":"всего просмотров до",
"total_videos_min":"всего видео от",
"total_videos_max":"всего видео до",
"lastest_video_min":"последнее вмдео от",
"lastest_video_max":"поседнее видео до",
"keywords":"ключевые слова"
}
RU2={}

for i in ['category','lang','topics','country']:
    eng, ru = eval(i), eval('ru_'+i)
    RU2.update({val:ru[key] for key, val in eng.items() if key in ru})

rus_words = [w.strip() for arg in ['ru_country','ru_lang', 'ru_topics','ru_category'] for w in eval(arg).values()]
eng_words = [w.strip() for arg in ['country','lang', 'topics','category'] for w in eval(arg).values()]

query = {"name_chanell":"",
        "topics":[],  
        "lang":[], 
        "country":[], 
        "category":[],
        "creation_date_min":"", 
        "creation_date_max":"",
        "subscribers_min":"", 
        "subscribers_max":"",
        "total_views_min":"", 
        "total_views_max":"",
        "total_videos_min":"",
        "total_videos_max":"", 
        "lastest_video_min":"",
        "lastest_video_max":"",
        "keywords":""}


query1=query.copy()
Temp=''
URL=''